#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//******************函数****************************
//int Add(int x, int y)//自定义函数 
//{
//	int z = x + y;
//	return z;
//}
//int main()
//{
//	int num1 = 10;
//	int num2 = 20;
//	int num3 = 0;
//	int a = 100;
//	int b = 200;
//	//sum = num1 + num2;
//	sum = Add(num1, num2);
//	//sum = a + b;
//	sum = Add(a, b);
//	printf("sum = %d\n", sum);
//	return 0;
//}
//********************数组*******************************
//int main()
//{
//	//int a = 1;
//	//int b = 2;
//	//int c = 3;
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,0 };
//	//语法里规定了没个数字都有哟个下标0，1，2，3，4，5，6，7，8，9
//	//小标从0开始
//	//定义一个存放10个整数数字的数组
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d\n", arr[i]);//输出5，用下标也可以访问元素：arr[下标]
//		i++;
//	}			   //char  ch[20];
//	//float arr2[5];
//	return 0;
//} 
//****************操作符***************************
//除号  /
//int main()
//{
//	int a = 5 / 2;//取模
//	printf("%d\n", a);//再除法中得出的时商 2
//	return 0;
//}
//移位操作符 
//<<左移   >>右移（移的是二进制位）
//int main()
//{
//	int a = 1;
//	//整型1占4个字节= 32bit位
//	//00000000000000000000000000000001
//	int b = a << 1;
//	//b = a + 1;
//	printf("%d\n", b);//输出2，实际上是1在计算机中保存的32位bit位向坐移动一位，后4位变成了0010
//	printf("%d\n", a);//在进行移位运算后，因为没有赋值给a，所以a的数值不变
//	return 0;
//}


//位操作（二进制位）
	//& 按位与
	//| 按位或
	//^ 按位异或
//int main()
//{
//	int a = 3;//011
//	int b = 5;//101
//	//1. int c = a & b;//C语言中，0表示false， 非0 表示true
//	//2. int c = a | b;
//	int c = a ^ b;
//	//a: 011    按位与：与门，当两个都是对的时候，才是对的
//	//b: 101
//	//c: 1. 001    2. 111     3. 110  异或：对应的二级制位相同为0，相异为1
//	//只有第三位都是1，所以结果位001（二进制），结果为十进制
//	printf("%d\n", c);//1.输出1   2.输出7  3.输出6 
//
//		return 0;
//}
//**************************赋值操作符**************************
//int main()
//{
//	int a = 10;
//	a = 20;// = 赋值，  ==： 判断相等
//	a = a + 10;
//	a += 10;
//
//	a = a - 20;
//	a -= 20;
//
//	a = a & 20;
//	a &= 20;
////复合操作符
//	//+=  -=  *=  /=  %=  >>=  >>=  &=  |=  ^= 
//
//	return 0;
//}

//单目操作符
//双目操作符
//三目操作符 
//int main()
//{
//	//int a = 10;
//	//int b = 20;
//	//c = a + b;//+ 双目操作符，有两个操作数	  
//	int a = 10;
//	printf("%d\n", a);//输出10
//	printf("%d\n", !a);//输出0 ，逻辑反操作（真变假），10为真，变为假0
//	return 0;
//}
//********sizeof********
//int main()
//{
//	int a = 10;
//	//sizzeof 计算变量/类型所占空间的大小，单位是字节
//	printf("%d\n", sizeof(a));//4
//	printf("%d\n", sizeof(int));//4
//	printf("%d\n", sizeof a);//4
//	//printf("%d\n", sizeof int);//错误，（）不可省略
//	//sizeof 在使用变量名的时候可以省略
//
//	return 0;
//}

//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9 };//10个整型元素的数组
//	int sz = 0;
//	//10 * sizeof（int）= 40
//	printf("%d\n", sizeof(arr));
//	//计算数组的元素个数
//	//个数 = 数组大小 / 每个元素大小
//	sz = sizeof(arr) / sizeof(arr[0]);
//	printf("sz = %d\n", sz);
//
//	return 0;
//}

//****************~单目操作符****************
//int main()
//{
//	int a = 0;
//	int b = ~a;
//	//~ -- 按位取反（二进制）
//	//00000000000000000000000000000000
//	//11111111111111111111111111111111   //最高位表示符号位，表负数
//	printf("b = %d\n", b);//输出b = -1
//	//原码， 反码，补码
//	//负数在内存中储存的的时候，储存的是二进制补码
//	//我们打印的是这个数的原码
//	//11111111111111111111111111111111
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001   输出的结果
//	return 0;
//}

//****************************++操作符********************
//int main() 
//{
//	int a = 10;
//	//int b = a++;//后置++： 先使用a给b赋值，在自己+1
//	//int b = ++a;  //前置++： 先自己+1， 再赋值给b
//	int b = a--;
//	printf("a = %d  b = %d\n",a, b);//输出9 10
//}

//*******************强制类型转换操作符*********************
//int main()
//{
//	int a = (int)3.14;
//	printf("%d\n", a);//3  double-->int
//
//	return 0;
//}

//****************关系操作符*************************
//>  >=  <  <=  !=(测试不相等)  ==（测试相等）
//**************逻辑操作符***************
//0 -- 假
//非0 -- 真
//&& 逻辑与  并且
//|| 逻辑或  两个有一个为真，就是真
int main()
{
	int a = 0;//3; //  真
	int b = 5;//  真
	//int c = a && b;
	int c = a || b;
	printf("%d\n", c);// 1

	return 0; 
}
